## CM4044: AI In Chemistry
## Semester 1 2020/21

<hr>

## Tutorial 3b: Introduction to DataFrame in Pandas Part II
##Â Objective ##
### $\bullet$ Time Series
### $\bullet$ Combining Data
### $\bullet$ Grouping Data

<hr>

To use Pandas library, one has to import it.

In [1]:
import numpy as np
import pandas as pd

## 1. Time Series

Pandas contains extensive capabilities and features for working with time series data for all domains. Using the NumPy `datetime64` and `timedelta64` dtypes, pandas has consolidated a large number of features from other Python libraries like `scikits.timeseries` as well as created a tremendous amount of new functionality for manipulating time series data.

This tutorial practises some usage of time series. Firstly, let us create a temperature list:

In [2]:
# temprature in celsius
temp_c = [ 8.0,  7.1,  6.8,  6.4,  6.0,  5.4,  4.8,  5.0,
         9.1, 12.8, 15.3, 19.1, 21.2, 22.1, 22.4, 23.1,
         21.0, 17.9, 15.5, 14.4, 11.9, 11.0, 10.2,  9.1]

Then, we generate a time series by `Pandas.date_range(start,periods,freq)`

In [3]:
dt = pd.date_range(start='2019-10-27 00:00:00.0', periods=24, freq='H')
print(type(dt))   # the data type is DatetimeIndex
print(dt)

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>
DatetimeIndex(['2019-10-27 00:00:00', '2019-10-27 01:00:00',
               '2019-10-27 02:00:00', '2019-10-27 03:00:00',
               '2019-10-27 04:00:00', '2019-10-27 05:00:00',
               '2019-10-27 06:00:00', '2019-10-27 07:00:00',
               '2019-10-27 08:00:00', '2019-10-27 09:00:00',
               '2019-10-27 10:00:00', '2019-10-27 11:00:00',
               '2019-10-27 12:00:00', '2019-10-27 13:00:00',
               '2019-10-27 14:00:00', '2019-10-27 15:00:00',
               '2019-10-27 16:00:00', '2019-10-27 17:00:00',
               '2019-10-27 18:00:00', '2019-10-27 19:00:00',
               '2019-10-27 20:00:00', '2019-10-27 21:00:00',
               '2019-10-27 22:00:00', '2019-10-27 23:00:00'],
              dtype='datetime64[ns]', freq='H')

Now, we create a `DataFrame` to keep temperature and use `DatetimeIndex` as row index:

In [4]:
temp = pd.DataFrame(data={'temp_c': temp_c}, index=dt)  # temperatures of a city in a day, the measurement freq = 1 h
temp

                     temp_c
2019-10-27 00:00:00     8.0
2019-10-27 01:00:00     7.1
2019-10-27 02:00:00     6.8
2019-10-27 03:00:00     6.4
2019-10-27 04:00:00     6.0
2019-10-27 05:00:00     5.4
2019-10-27 06:00:00     4.8
2019-10-27 07:00:00     5.0
2019-10-27 08:00:00     9.1
2019-10-27 09:00:00    12.8
2019-10-27 10:00:00    15.3
2019-10-27 11:00:00    19.1
2019-10-27 12:00:00    21.2
2019-10-27 13:00:00    22.1
2019-10-27 14:00:00    22.4
2019-10-27 15:00:00    23.1
2019-10-27 16:00:00    21.0
2019-10-27 17:00:00    17.9
2019-10-27 18:00:00    15.5
2019-10-27 19:00:00    14.4
2019-10-27 20:00:00    11.9
2019-10-27 21:00:00    11.0
2019-10-27 22:00:00    10.2
2019-10-27 23:00:00     9.1

It is normal to index and slice the `DataFrame` by the row index, which is a time series in this case. For example, to extract the temperature information between 05:00 to 14:00,

In [5]:
temp['2019-10-27 05':'2019-10-27 14']

                     temp_c
2019-10-27 05:00:00     5.4
2019-10-27 06:00:00     4.8
2019-10-27 07:00:00     5.0
2019-10-27 08:00:00     9.1
2019-10-27 09:00:00    12.8
2019-10-27 10:00:00    15.3
2019-10-27 11:00:00    19.1
2019-10-27 12:00:00    21.2
2019-10-27 13:00:00    22.1
2019-10-27 14:00:00    22.4

We can calculate `.mean()`, `.max()`, `.max()` by `.resample(rule)`:

In [6]:
temp.resample(rule='6h').mean()    # mean temperature at every 6 hours

                        temp_c
2019-10-27 00:00:00   6.616667
2019-10-27 06:00:00  11.016667
2019-10-27 12:00:00  21.283333
2019-10-27 18:00:00  12.016667

In [7]:
temp.resample(rule='6h').max()    # highest temperature at every 6 hours

                     temp_c
2019-10-27 00:00:00     8.0
2019-10-27 06:00:00    19.1
2019-10-27 12:00:00    23.1
2019-10-27 18:00:00    15.5

In [8]:
temp.resample(rule='6h').min()   # lowest temperature at every six hours

                     temp_c
2019-10-27 00:00:00     5.4
2019-10-27 06:00:00     4.8
2019-10-27 12:00:00    17.9
2019-10-27 18:00:00     9.1

We may also need to do some rolling-window analysis. This involves calculating a statistic for a specified number of adjacent rows, which make up your window of data. You can ârollâ the window by selecting a different set of adjacent rows to perform your calculations on. Pandas provides the method `.rolling(window)` for this purpose:

In [9]:
 temp.rolling(window=3).mean()

                        temp_c
2019-10-27 00:00:00        NaN
2019-10-27 01:00:00        NaN
2019-10-27 02:00:00   7.300000
2019-10-27 03:00:00   6.766667
2019-10-27 04:00:00   6.400000
2019-10-27 05:00:00   5.933333
2019-10-27 06:00:00   5.400000
2019-10-27 07:00:00   5.066667
2019-10-27 08:00:00   6.300000
2019-10-27 09:00:00   8.966667
2019-10-27 10:00:00  12.400000
2019-10-27 11:00:00  15.733333
2019-10-27 12:00:00  18.533333
2019-10-27 13:00:00  20.800000
2019-10-27 14:00:00  21.900000
2019-10-27 15:00:00  22.533333
2019-10-27 16:00:00  22.166667
2019-10-27 17:00:00  20.666667
2019-10-27 18:00:00  18.133333
2019-10-27 19:00:00  15.933333
2019-10-27 20:00:00  13.933333
2019-10-27 21:00:00  12.433333
2019-10-27 22:00:00  11.033333
2019-10-27 23:00:00  10.100000

In the example above, the third value (7.3) is the mean temperature for the first three hours (00:00:00, 01:00:00, and 02:00:00). The fourth value is the mean temperature for the hours 02:00:00, 03:00:00, and 04:00:00. The last value is the mean temperature for the last three hours, 21:00:00, 22:00:00, and 23:00:00. The first two values are missing because there isnât enough data to calculate them.

## 2. Combining Data

Sometimes, we may need to combine data in two or more `DataFrame` objects. Pandans provides three powerful methods for `DataFrame` combination:

- `.merge()` for combining data on common columns or indices
- `DataFrame.join()` for combining data on a key column or an index
- `.concat()` for combining DataFrames across rows or columns

You can see that, both `.merge()` and `.concat()` are the module methods under Pandas and object methods of a `DataFrame`, and `.join` is the object method of a `DataFrame` object.

### 2.1 `pd.concat()`

With concatenation, your datasets are just stitched together along an axis â either the row axis or column axis.

Along row axis:

<img src="./concat_axis0.webp" width="500" height="500" />

Along column axis:

<img src="./concat_col.webp" width="500" height="500" />

In [10]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

print(df1)

print()

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[0, 1, 2, 3])
print(df2)

print()

# although keys parameter is optional, 
# we can use it to label the data set.
df3 = pd.concat([df1, df2], keys=['df1','df2'])

print(df3)
print()

print(df3.loc['df1'])   # use keys to locate the original data set

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

        A   B   C   D
df1 0  A0  B0  C0  D0
    1  A1  B1  C1  D1
    2  A2  B2  C2  D2
    3  A3  B3  C3  D3
df2 0  A4  B4  C4  D4
    1  A5  B5  C5  D5
    2  A6  B6  C6  D6
    3  A7  B7  C7  D7

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [11]:
df4 =  pd.concat([df1, df2], axis = 1)    # axis = 1 is column axis
print(df4)

    A   B   C   D   A   B   C   D
0  A0  B0  C0  D0  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7

A short cut to concatenate different `DataFrame` objects along row axis is to use `DataFrame.append()`. For example:

In [12]:
df5 = df1.append(df2)
print(df5)    # same as pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In concatenation, the default `join` value is `outer`, meaning to take union of all objects without any loss.
We can also change to `join = 'inner'` to generate intersect of the data sets. For example:

In [13]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])

print(df1)
print()

print(df4)
print()


df5 = pd.concat([df1, df4], join = 'inner', axis = 1)
print(df5)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

`pandas.concat()` takes a list or dict of homogeneously-typed objects and concatenates them with some configurable handling of âwhat to do with the other axes":

`pd.concat(objs, axis=0, join='outer', ignore_index=False, keys=None,
          levels=None, names=None, verify_integrity=False, copy=True)`
          
More examples can be found from the document [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)

### 2.2 `pd.merge()`

The `pd.merge()` offers great flexibilities to combine data sets in the style of the join action in the popular rational databases (MS SQL, My SQL, Oracle Database and IBM DB2). When we want to combine data objects based on one or more keys in a similar way to a relational database, `pandas.merge()` is the tool you need. More specifically, `pandas.merge()` is most useful when you want to combine **rows** that share data.

The `pd.merge()` has a sheer number of options about how to merge data. Most of the parameters have their default options, but two options have to be explicitly passed in, the `left` and `right` `DataFrame` objects.j

`pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=True,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)`
         
In this tutorial we explore the use of three options: `how`, `on` and `validate`. For the full details, please check Pandas documentation [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)

In [14]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})


# the option "on" instructs which label in the dataframe to join data
result = pd.merge(left,right, on='key') 

print(left)
print()
print(right)
print()
print(result)

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

There are four modes of joining two sets of data, set by the `join` option in `Pandas.merge()`. The four modes are:

- left
- right
- inner
- outer

This figure can help to understand the four join modes:
<img src="./join_diagram.webp" width="400" height="400" />

In [15]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                      'key2': ['K0', 'K1', 'K0', 'K1'],
                      'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3']})

print(left)
print()

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                       'key2': ['K0', 'K0', 'K0', 'K0'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})
print(right)
print()

# double keys
result = pd.merge(left, right, on=['key1', 'key2'])     # the default join mode is inner
print(result)

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [16]:
result = pd.merge(left, right, how='left', on=['key1', 'key2'])     # join by keys in left DataFrame
print(result)

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [17]:
result = pd.merge(left, right, how='right', on=['key1', 'key2'])     # join by keys in right DataFrame
print(result)

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [18]:
result = pd.merge(left, right, how='inner', on=['key1', 'key2'])     # join by keys in inner mode
print(result)

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [19]:
result = pd.merge(left, right, how='outer', on=['key1', 'key2'])     # join by all available keys
print(result)

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

We can also apply more criteria on data merging, for example, we can check if the keys to join data have duplicates by `validate` option. The `validate` option has one of the following four values:

- âone_to_oneâ or â1:1â: checks if merge keys are unique in both left and right datasets.
- âone_to_manyâ or â1:mâ: checks if merge keys are unique in left dataset.
- âmany_to_oneâ or âm:1â: checks if merge keys are unique in right dataset.
- âmany_to_manyâ or âm:mâ: allowed, but does not result in checks.

In the following example, there are duplicate values of B in the right `DataFrame`. As this is not a one-to-one merge â as specified in the validate argument â an exception will be raised.

In [20]:
left = pd.DataFrame({'A' : [1,2], 'B' : [1, 2]})
print(left)

print()

right = pd.DataFrame({'A' : [4,5,6], 'B': [2, 2, 2]})
print(right)
print()

#result = pd.merge(left, right, on='B', how='outer', validate="one_to_one")
#print(result)

   A  B
0  1  1
1  2  2

   A  B
0  4  2
1  5  2
2  6  2

In [21]:
result = pd.merge(left, right, on='B', how='outer', validate="one_to_many")
print(result)

   A_x  B  A_y
0    1  1  NaN
1    2  2  4.0
2    2  2  5.0
3    2  2  6.0

In [22]:
result = pd.merge(left, right, on='B', how='outer', validate="many_to_many")
print(result)

   A_x  B  A_y
0    1  1  NaN
1    2  2  4.0
2    2  2  5.0
3    2  2  6.0

### 2.3 `DataFrame.join()`

`DataFrame.join()` is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame. Internally, `.join()` uses `.merge()` but with less options.

`DataFrame.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)`

Here is a very basic example for join by index:

In [23]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                    'B': ['B0', 'B1', 'B2']},
                    index=['K0', 'K1', 'K2'])
print(left)

print()

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                       'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])
print(right)
print()

result = left.join(right)
print('result from default options:')
print(result)

print()

result = left.join(right, how = 'inner')
#result = pd.merge(left, right, left_index=True, right_index=True, how='inner')
print('result from inner join:')
print(result)

print()

result = left.join(right, how = 'outer')
# result = pd.merge(left, right, left_index=True, right_index=True, how='outer')
print('result from outer join:')
print(result)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

result from default options:
     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

result from inner join:
     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

result from outer join:
      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

Here is another example to joining key columns on an index:

In [24]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                      'key': ['K0', 'K1', 'K0', 'K1']})

print(left)
print()

right = pd.DataFrame({'C': ['C0', 'C1'],
                       'D': ['D0', 'D1']},
                      index=['K0', 'K1'])
print(right)
print()

result = left.join(right, on='key')
#result = pd.merge(left, right, left_on='key', right_index=True, how='left', sort=False)
print(result)

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K0
3  A3  B3  K1

     C   D
K0  C0  D0
K1  C1  D1

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K0  C0  D0
3  A3  B3  K1  C1  D1

## 3. Grouping Data

Pandas `DataFrame.groupby()` functionality offers great power in the 'splitting-applying-combing' process in data analysis. 
By âgroup byâ we are referring to a process involving one or more of the following steps:

- Splitting the data into groups based on some criteria.

- Applying a function to each group independently.

- Combining the results into a data structure.

Groupby essentially splits the data into different groups depending on a variable of your choice. 

The `groupby()` function returns a `GroupBy` object, but essentially describes how the rows of the original data set has been split. The `DataFrame.groupby([axis label]).groups` variable is a `dictionary` object whose keys are the computed unique groups and corresponding values being the `axis labels` belonging to each group. For example:

### 3.1 Splitting data into groups

pandas objects can be split on any of their axes. The abstract definition of grouping is to provide a mapping of labels to group names. To create a `GroupBy` object (more on what the `GroupBy` object is later), you may do the following:

In [25]:
animals = pd.DataFrame([('bird', 'Falconiformes', 389.0),
                   ('bird', 'Psittaciformes', 24.0),
                    ('mammal', 'Carnivora', 80.2),
                    ('mammal', 'Primates', np.nan),
                    ('mammal', 'Carnivora', 58)],
                   index=['falcon', 'parrot', 'lion', 'monkey', 'leopard'],
                   columns=('class', 'order', 'max_speed'))
print(animals)

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [26]:
grouped_class= animals.groupby('class')   # group animals by class
print(type(grouped_class))
grouped_order = animals.groupby('order', axis = 1)   # group animals by order and along column axis
print(type(grouped_order))
grouped_class_order = animals.groupby(['class', 'order'])   # group animals by class and order
print(type(grouped_class_order))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

### 3.2 Exploring groups and applying methods

Once data are grouped, the information is hold with two attributes: `.groups` and `.indices`. They are the `Dictionary` objects. So we can explore the dictionares:

In [27]:
print(grouped_class.groups)    # check the group dictionary

print()

print(grouped_class.groups.keys())    # check the keys of the group dictionary

print()

print(grouped_class.groups.values())    # check the keys of the group dictionary

print()

print(grouped_class.indices)     # the last index dictionary

print()

{'bird': Index(['falcon', 'parrot'], dtype='object'), 'mammal': Index(['lion', 'monkey', 'leopard'], dtype='object')}

dict_keys(['bird', 'mammal'])

dict_values([Index(['falcon', 'parrot'], dtype='object'), Index(['lion', 'monkey', 'leopard'], dtype='object')])

{'bird': array([0, 1], dtype=int64), 'mammal': array([2, 3, 4], dtype=int64)}

Functions like `max()`, `min()`, `mean()`, `first()`, `last()` can be quickly applied to the `GroupBy` object to obtain summary statistics for each group.

In [28]:
grouped_class_order.mean()

                       max_speed
class  order
bird   Falconiformes       389.0
       Psittaciformes       24.0
mammal Carnivora            69.1
       Primates              NaN

In [29]:
grouped_class.max()

                 order  max_speed
class
bird    Psittaciformes      389.0
mammal        Primates       80.2

We can iterate the groups:

In [30]:
for name, group in grouped_class:
    print(type(name), name)
    print(type(group))
    print(group)

<class 'str'> bird
<class 'pandas.core.frame.DataFrame'>
       class           order  max_speed
falcon  bird   Falconiformes      389.0
parrot  bird  Psittaciformes       24.0
<class 'str'> mammal
<class 'pandas.core.frame.DataFrame'>
          class      order  max_speed
lion     mammal  Carnivora       80.2
monkey   mammal   Primates        NaN
leopard  mammal  Carnivora       58.0

In [31]:
for name, group in grouped_class_order:
    print(name)
    print(group)

('bird', 'Falconiformes')
       class          order  max_speed
falcon  bird  Falconiformes      389.0
('bird', 'Psittaciformes')
       class           order  max_speed
parrot  bird  Psittaciformes       24.0
('mammal', 'Carnivora')
          class      order  max_speed
lion     mammal  Carnivora       80.2
leopard  mammal  Carnivora       58.0
('mammal', 'Primates')
         class     order  max_speed
monkey  mammal  Primates        NaN

We apply method to columns of the `DataFrame`.

In [32]:
#get_group with key 'mammal' and do descriptive statistics of max_speed column

print(grouped_class.get_group('mammal')['max_speed'].max())
print(grouped_class.get_group('mammal')['max_speed'].min())
print(grouped_class.get_group('mammal')['max_speed'].mean())

80.2
58.0
69.1

Pandas makes the calculation of different statistics very simple. For example, mean, max, min, standard deviations and more for columns are easily calculable:

Method|Description|Method|Description
--- | --- | --- | ---
count() | Number of non-null observations | sum() | Sum of values
mean() | Mean of values | mad() |	Mean absolute deviation
median() | Arithmetic median of values | min()	| Minimum
max() |	Maximum | mode() |	Mode 
abs() |	Absolute Value | prod() |	Product of values
std() |	Unbiased standard deviation | var() |	Unbiased variance
sem() |	Unbiased standard error of the mean | skew() |	Unbiased skewness (3rd moment)
kurt() |	Unbiased kurtosis (4th moment) | quantile() |	Sample quantile (value at %)
cumsum() |	Cumulative sum | cumprod() |	Cumulative product
cummax() |	Cumulative maximum | cummin() |	Cumulative minimum

### 3.3 Aggregation

Aggregation is a process in which we compute a summary statistic about each group.

In [33]:
grouped_class.aggregate(np.sum)   # shorthand is agg(np.sum)

        max_speed
class
bird        413.0
mammal      138.2

In [34]:
grouped_class.size()

class
bird      2
mammal    3
dtype: int64

In [35]:
grouped_class.describe()

       max_speed
           count   mean         std   min     25%    50%     75%    max
class
bird         2.0  206.5  258.093975  24.0  115.25  206.5  297.75  389.0
mammal       2.0   69.1   15.697771  58.0   63.55   69.1   74.65   80.2

In [36]:
grouped_class.agg([np.sum, np.max, np.min, np.mean])  # apply several methods together

       max_speed
             sum   amax  amin   mean
class
bird       413.0  389.0  24.0  206.5
mammal     138.2   80.2  58.0   69.1

Let us use another data to demonstrate aggregation:

In [37]:
# Define a dictionary containing employee data  
data1 = {'Name':['John', 'Annie', 'John', 'Peter',  
                 'Gordon', 'Annie', 'Peter', 'Allen'],  
        'Age':[27, 24, 22, 32,  
               33, 36, 27, 32],  
        'Address':['Newton', 'Alington', 'York', 'Paris', 
                   'Bedford', 'Alington', 'York', 'Bedford'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
                         'B.Tech', 'B.com', 'Msc', 'MA'], 
        'Score': [23, 34, 35, 45, 47, 50, 52, 53]}  
     
   
# Convert the dictionary into DataFrame   
df = pd.DataFrame(data1) 
   
print(df)  

print()

# using different aggregation 
# function by passing dictionary 
# to aggregate 
grp1 = df.groupby(['Name', 'Qualification']) 
print(grp1.aggregate(np.sum))
print()
  
grp = df.groupby('Name')
print(grp.agg({'Age' : 'sum', 'Score' : 'std'}) )

     Name  Age   Address Qualification  Score
0    John   27    Newton           Msc     23
1   Annie   24  Alington            MA     34
2    John   22      York           MCA     35
3   Peter   32     Paris           Phd     45
4  Gordon   33   Bedford        B.Tech     47
5   Annie   36  Alington         B.com     50
6   Peter   27      York           Msc     52
7   Allen   32   Bedford            MA     53

                      Age  Score
Name   Qualification
Allen  MA              32     53
Annie  B.com           36     50
       MA              24     34
Gordon B.Tech          33     47
John   MCA             22     35
       Msc             27     23
Peter  Msc             27     52
       Phd             32     45

        Age      Score
Name
Allen    32        NaN
Annie    60  11.313708
Gordon   33        NaN
John     49   8.485281
Peter    59   4.949747

### 3.4 Transformation

Transformation is a process in which we perform some group-specific computations and return a like-indexed.

In [38]:
grp = df.groupby('Name') 
sc = lambda x: (x - x.mean()) / x.std()*10
grp.transform(sc)

        Age     Score
0  7.071068 -7.071068
1 -7.071068 -7.071068
2 -7.071068  7.071068
3  7.071068 -7.071068
4       NaN       NaN
5  7.071068  7.071068
6 -7.071068  7.071068
7       NaN       NaN

### 3.5 Filtration 

Filtration is a process in which we discard some groups, according to a group-wise computation that evaluates True or False.

In [39]:
# filtering data using 
# filter data 
grp = df.groupby('Name') 
grp.filter(lambda x: len(x) >= 2)

    Name  Age   Address Qualification  Score
0   John   27    Newton           Msc     23
1  Annie   24  Alington            MA     34
2   John   22      York           MCA     35
3  Peter   32     Paris           Phd     45
5  Annie   36  Alington         B.com     50
6  Peter   27      York           Msc     52

There are alot more methods and tricks than what we have mentioned in this tutorial. Details can be found in the Pandas document [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html)